**Objetivos**

Este capítulo abordará:
1. Carga de dados manual.
2. O objeto `Series`.
3. Operações básicas em objetos `Series`.
4. O objeto `DataFrame`.
5. Subconjuntos condicionais e fatiamento e indexação sofisticados.
6. Como salvar dados.

In [55]:
import numpy as np
import pandas as pd
import random

s = pd.Series(["banana", 42]) # criando uma série
s

0    banana
1        42
dtype: object

In [2]:
a = pd.Series(["Corinthians", 1910], 
             index = ["time", "ano de fundação"])
a

time               Corinthians
ano de fundação           1910
dtype: object

In [3]:
my_dict = {"Name": ["Rosaline Franklin", "William Gosset", "Albert Bandura"],
           "Occupation": ["Chemist", "Statistician", "Psychologist"],
           "Born": ["1920-07-25", "1876-06-13", "1925-12-04"],
           "Died": ["1958-04-16", "1937-10-16", "2021-07-26"],
           "Age": [37, 61, 95]}

scientists = pd.DataFrame(my_dict)
scientists

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61
2     Albert Bandura  Psychologist  1925-12-04  2021-07-26   95

In [4]:
scientists = pd.DataFrame({"Occupation": ["Chemist", "Statistician", "Psychologist"],
           "Born": ["1920-07-25", "1876-06-13", "1925-12-04"],
           "Died": ["1958-04-16", "1937-10-16", "2021-07-26"],
           "Age": [37, 61, 95]},
                         index = ["Rosaline Franklin", "William Gosset", "Albert Bandura"],
                         columns = ["Occupation", "Born", "Died", "Age"]) # ordem das colunas

scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61
Albert Bandura     Psychologist  1925-12-04  2021-07-26   95

In [5]:
bandura = scientists.loc["Albert Bandura"]
type(bandura) # Series

pandas.core.series.Series

In [6]:
bandura.index # atributo de bandura

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [8]:
bandura.values # atributo de bandura

array(['Psychologist', '1925-12-04', '2021-07-26', 95], dtype=object)

In [9]:
bandura.keys() # método de bandura (alias do atributo index)

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [10]:
print(bandura.index[0])
print(bandura.keys()[0])

Occupation
Occupation

In [19]:
scientists = pd.read_csv("scientists.csv")
scientists.head()

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist

In [20]:
ages = scientists["Age"]
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [21]:
ages.mean()

59.125

In [22]:
ages.min()

37

In [23]:
ages.max()

90

In [24]:
ages.std()

18.325918413937288

In [25]:
ages.median()

58.5

In [26]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [28]:
ages > ages.mean() # retorna booleanos

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [29]:
ages[ages > ages.mean()] # imprime idades acima da média (usando cálculo vetorizado)

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [30]:
ages + ages # soma vetorizada

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [31]:
ages * ages # multiplicação vetorizada

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [32]:
ages + 100 # soma vetorizada com escalar

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [33]:
# types iguais
ages + pd.Series([1, 100]) # retorna NaN quando um índice não existe em um dos vetores

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [35]:
# types diferentes
ages + np.array([1, 100]) # retorna um erro se formatos não coincidirem

ValueError: operands could not be broadcast together with shapes (8,) (2,)

In [36]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [37]:
rev_ages = ages.sort_index(ascending = False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [38]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [39]:
ages + rev_ages # vetores são alinhados antes do cálculo

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [40]:
scientists["Age"] > scientists["Age"].mean() # idades acima da média

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [41]:
# retorna linhas cujas idades estão acima da média
scientists[scientists["Age"] > scientists["Age"].mean()]

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [43]:
# 8 valores passados como um vetor de booleanos
# 3 linhas devolvidas
scientists.loc[[True, True, False, True, False, False, False, False]]

                Name        Born        Died  Age    Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1     William Gosset  1876-06-13  1937-10-16   61  Statistician
3        Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [44]:
first_half = scientists[:4]
first_half

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist

In [45]:
second_half = scientists[4:]
second_half

            Name        Born        Died  Age          Occupation
4  Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5      John Snow  1813-03-15  1858-06-16   45           Physician
6    Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7   Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [46]:
scientists * 2

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [50]:
scientists["Born"].dtype # O = object = string

dtype('O')

In [52]:
born_datetime = pd.to_datetime(scientists["Born"], format = "%Y-%m-%d")
born_datetime

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [53]:
died_datetime = pd.to_datetime(scientists["Died"], format = "%Y-%m-%d")
died_datetime

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [54]:
# atribuição múltipla
scientists["born_dt"], scientists["died_dt"] = (born_datetime, died_datetime)
scientists.head()

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14

In [56]:
scientists["Age"]

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [58]:
random.seed(42)
random.shuffle(scientists["Age"])
scientists["Age"]

0    77
1    90
2    37
3    61
4    41
5    45
6    66
7    56
Name: Age, dtype: int64

In [60]:
# random_state é usado para deixar a aleatoriedade menos aleatória
scientists["Age"] = scientists["Age"].sample(len(scientists["Age"]), random_state = 24).reset_index(drop = True)
scientists["Age"]

0    56
1    45
2    66
3    41
4    90
5    77
6    61
7    37
Name: Age, dtype: int64

In [61]:
scientists["age_days_dt"] = scientists["died_dt"] - scientists["born_dt"]
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,56,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,45,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,66,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,41,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,77,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,61,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,37,Mathematician,1777-04-30,1855-02-23,28422 days

In [63]:
scientists["age_years_dt"] = scientists["age_days_dt"].astype("timedelta64[Y]")
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt,age_years_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,56,Chemist,1920-07-25,1958-04-16,13779 days,37.0
1,William Gosset,1876-06-13,1937-10-16,45,Statistician,1876-06-13,1937-10-16,22404 days,61.0
2,Florence Nightingale,1820-05-12,1910-08-13,66,Nurse,1820-05-12,1910-08-13,32964 days,90.0
3,Marie Curie,1867-11-07,1934-07-04,41,Chemist,1867-11-07,1934-07-04,24345 days,66.0
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14,20777 days,56.0
5,John Snow,1813-03-15,1858-06-16,77,Physician,1813-03-15,1858-06-16,16529 days,45.0
6,Alan Turing,1912-06-23,1954-06-07,61,Computer Scientist,1912-06-23,1954-06-07,15324 days,41.0
7,Johann Gauss,1777-04-30,1855-02-23,37,Mathematician,1777-04-30,1855-02-23,28422 days,77.0

In [64]:
# descartando colunas
scientists_dropped = scientists.drop(["Age"], axis = 1) # axis = 1 --> descartar toda a coluna
scientists_dropped.columns

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt', 'age_years_dt'],
      dtype='object')

In [66]:
# salvando os dados
scientists.to_csv("scientists_df.csv", sep = ",", index = False)

In [71]:
import openpyxl

names = scientists["Name"]
names_df = names.to_frame()
names_df.to_excel("scientists_names_series_df.xlsx",
                 sheet_name = "scientists",
                  index = False)